Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.131/PIC32CK-GC01/svd/PIC32CK2051GC01064.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>ETH</name>
         <version>037921b0</version>
         <description>Ethernet Controller</description>
         <baseAddress>0x45022000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1280</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>ETH</name>
            <description>Ethernet MAC Interrupt</description>
            <value>145</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>CTRLA Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Macro Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in standby mode</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRLB</name>
               <description>CTRLB Register</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x000000C0</resetValue>
               <fields>
                  <field>
                     <name>GMIIEN</name>
                     <description>Select GMII/MII mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GBITCLKREQ</name>
                     <description>Gigabit clock request</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TSUCLKREQ</name>
                     <description>TSU Clock Request</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TSUMS</name>
                     <description>Timer Adjust</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TSUINC</name>
                     <description>Timer Adjust Mode</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EVCTRL</name>
               <description>Event Control Register</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CMPEO</name>
                     <description>Compare Event Out enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYNCB</name>
               <description>Sync Busy Register</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset Sync Busy</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable Sync Busy</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NCR</name>
               <description>Network Control Register</description>
               <addressOffset>0x1000</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LBL</name>
                     <description>Loop Back Local</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXEN</name>
                     <description>Receive Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEN</name>
                     <description>Transmit Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MPE</name>
                     <description>Management Port Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRSTAT</name>
                     <description>Clear Statistics Registers</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INCSTAT</name>
                     <description>Increment Statistics Registers</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WESTAT</name>
                     <description>Write Enable for Statistics Registers</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BP</name>
                     <description>Back pressure</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TSTART</name>
                     <description>Start Transmission</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>THALT</name>
                     <description>Transmit Halt</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXPF</name>
                     <description>Transmit Pause Frame</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXZQPF</name>
                     <description>Transmit Zero Quantum Pause Frame</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRTSM</name>
                     <description>Store Receive Time Stamp to Memory</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENPBPR</name>
                     <description>Enable PFC Priority-based Pause Reception</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXPBPF</name>
                     <description>Transmit PFC Priority-based Pause Frame</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FNP</name>
                     <description>Flush Next Packet</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPI</name>
                     <description>Low Power Idle Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NCFGR</name>
               <description>Network Configuration Register</description>
               <addressOffset>0x1004</addressOffset>
               <size>32</size>
               <resetValue>0x00080000</resetValue>
               <fields>
                  <field>
                     <name>SPD</name>
                     <description>Speed</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FD</name>
                     <description>Full Duplex</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DNVLAN</name>
                     <description>Discard Non-VLAN FRAMES</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JFRAME</name>
                     <description>Jumbo Frame Size</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAF</name>
                     <description>Copy All Frames</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NBC</name>
                     <description>No Broadcast</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MTIHEN</name>
                     <description>Multicast Hash Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNIHEN</name>
                     <description>Unicast Hash Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MAXFS</name>
                     <description>1536 Maximum Frame Size</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GIGE</name>
                     <description>Gigabit mode Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTY</name>
                     <description>Retry Test</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PEN</name>
                     <description>Pause Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXBUFO</name>
                     <description>Receive Buffer Offset</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LFERD</name>
                     <description>Length Field Error Frame Discard</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RFCS</name>
                     <description>Remove FCS</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLK</name>
                     <description>MDC CLock Division</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>DBW</name>
                     <description>Data Bus Width</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DCPF</name>
                     <description>Disable Copy of Pause Frames</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXCOEN</name>
                     <description>Receive Checksum Offload Enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EFRHD</name>
                     <description>Enable Frames Received in Half Duplex</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IRXFCS</name>
                     <description>Ignore RX FCS</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IPGSEN</name>
                     <description>IP Stretch Enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXBP</name>
                     <description>Receive Bad Preamble</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IRXER</name>
                     <description>Ignore IPG GRXER</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NSR</name>
               <description>Network Status Register</description>
               <addressOffset>0x1008</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000004</resetValue>
               <fields>
                  <field>
                     <name>MDIO</name>
                     <description>MDIO Input Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDLE</name>
                     <description>PHY Management Logic Idle</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UR</name>
               <description>User Register</description>
               <addressOffset>0x100C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>UO</name>
                     <description>User Programmable Outputs</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>UI</name>
                     <description>User Programmable Inputs</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCFGR</name>
               <description>DMA Configuration Register</description>
               <addressOffset>0x1010</addressOffset>
               <size>32</size>
               <resetValue>0x00020704</resetValue>
               <fields>
                  <field>
                     <name>FBLDO</name>
                     <description>Fixed Burst Length for DMA Data Operations:</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>ESMA</name>
                     <description>Endian Swap Mode Enable for Management Descriptor Accesses</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESPA</name>
                     <description>Endian Swap Mode Enable for Packet Data Accesses</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXBMS</name>
                     <description>Receiver Packet Buffer Memory Size Select</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>TXPBMS</name>
                     <description>Transmitter Packet Buffer Memory Size Select</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXCOEN</name>
                     <description>Transmitter Checksum Generation Offload Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRBS</name>
                     <description>DMA Receive Buffer Size</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DDRP</name>
                     <description>DMA Discard Receive Packets</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TSR</name>
               <description>Transmit Status Register</description>
               <addressOffset>0x1014</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>UBR</name>
                     <description>Used Bit Read</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COL</name>
                     <description>Collision Occurred</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RLE</name>
                     <description>Retry Limit Exceeded</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXGO</name>
                     <description>Transmit Go</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TFC</name>
                     <description>Transmit Frame Corruption Due to AHB Error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXCOMP</name>
                     <description>Transmit Complete</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UND</name>
                     <description>Transmit Underrun</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCOL</name>
                     <description>Late Colision Occured</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HRESP</name>
                     <description>HRESP Not OK</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RBQB</name>
               <description>Receive Buffer Queue Base Address</description>
               <addressOffset>0x1018</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Receive Buffer Queue Base Address</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBQB</name>
               <description>Transmit Buffer Queue Base Address</description>
               <addressOffset>0x101C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Transmit Buffer Queue Base Address</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
